In [1]:
!pip install pandas

Collecting pandas
  Using cached https://files.pythonhosted.org/packages/18/f0/905058bd437423591491092d7e42244babd0c19861e6b1abdadb199a1321/pandas-1.1.4-cp38-cp38-macosx_10_9_x86_64.whl
Requirement already satisfied: python-dateutil>=2.7.3 in ./venv/lib/python3.8/site-packages (from pandas) (2.8.1)
Collecting numpy>=1.15.4 (from pandas)
  Downloading https://files.pythonhosted.org/packages/0b/bc/a5eecf00251948d1c31434c6164368767e5c860984a99ca571ae505c37ea/numpy-1.19.4-cp38-cp38-macosx_10_9_x86_64.whl (15.3MB)
    100% |████████████████████████████████| 15.3MB 1.9MB/s ta 0:00:011
Collecting pytz>=2017.2 (from pandas)
  Downloading https://files.pythonhosted.org/packages/12/f8/ff09af6ff61a3efaad5f61ba5facdf17e7722c4393f7d8a66674d2dbd29f/pytz-2020.4-py2.py3-none-any.whl (509kB)
    100% |████████████████████████████████| 512kB 484kB/s ta 0:00:011
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: numpy, pytz, pandas
Successfully installed numpy-1.19.4 pandas-1.1.4 pytz-2020.4

In [2]:
import pandas as pd

df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [3]:
df.loc[0] = ['Allen', '18', '175']

In [4]:
df

    Name Age Height
0  Allen  18    175

In [7]:
df.loc[2] = ['Ted', '22', '180']

In [8]:
df

    Name Age Height
0  Allen  18    175
2    Ted  22    180

In [14]:
df.loc[1] = ['Judy', '24', '180']

In [15]:
df

    Name Age Height
0  Allen  18    175
2    Ted  22    180
1   Judy  24    180

In [21]:
df['Weight'] = ['75', '78', '79']

In [22]:
df

    Name Age Height Weight
0  Allen  18    175     75
2    Ted  22    180     78
1   Judy  24    180     79

In [24]:
df.drop('Weight', axis=1)

    Name Age Height
0  Allen  18    175
2    Ted  22    180
1   Judy  24    180

In [25]:
df

    Name Age Height Weight
0  Allen  18    175     75
2    Ted  22    180     78
1   Judy  24    180     79

In [26]:
df = df.drop('Weight', axis=1)
df

    Name Age Height
0  Allen  18    175
2    Ted  22    180
1   Judy  24    180

In [27]:
df = df.drop(2)
df

    Name Age Height
0  Allen  18    175
1   Judy  24    180

In [28]:
df.drop(['Height', 'Age'], axis=1)

    Name
0  Allen
1   Judy

In [29]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Allen', '18', '175'],
    ['Ted', '22', '180']
]

df = pd.DataFrame(data=data, columns=columns)
df

    Name Age Height
0  Allen  18    175
1    Ted  22    180

In [30]:
df['Name']

0    Allen
1      Ted
Name: Name, dtype: object

In [31]:
df['Age']

0    18
1    22
Name: Age, dtype: object

In [32]:
df.loc[0]

Name      Allen
Age          18
Height      175
Name: 0, dtype: object

In [33]:
df

    Name Age Height
0  Allen  18    175
1    Ted  22    180

In [34]:
df2 = df
df2

    Name Age Height
0  Allen  18    175
1    Ted  22    180

In [35]:
df2['Age'] = 100

In [36]:
df2

    Name  Age Height
0  Allen  100    175
1    Ted  100    180

In [37]:
df

    Name  Age Height
0  Allen  100    175
1    Ted  100    180

In [38]:
df3 = df.copy()

In [39]:
df3

    Name  Age Height
0  Allen  100    175
1    Ted  100    180

In [40]:
df

    Name  Age Height
0  Allen  100    175
1    Ted  100    180

In [41]:
df3['Height'] = 'aaaaaaa'

In [42]:
df3

    Name  Age   Height
0  Allen  100  aaaaaaa
1    Ted  100  aaaaaaa

In [43]:
df

    Name  Age Height
0  Allen  100    175
1    Ted  100    180

In [ ]:
df.merge()
df.join()